fundamental_twod_motion/wake_capture_2d_job_pack/Re100.0_stroke5.0_acf0.125_pf0.5/backGround/system/FOforceCoefficients
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs_object
{
    // rhoInf - reference density
    // CofR - Centre of rotation
    // dragDir - Direction of drag coefficient
    // liftDir - Direction of lift coefficient
    // pitchAxis - Pitching moment axis
    // magUinf - free stream velocity magnitude
    // lRef - reference length
    // Aref - reference area
    type forceCoeffs;
    libs ("libforces.so");
    patches (wing);

    writeControl writeTime;
    //writeControl   timeStep;
    //writeInterval  1;

    pName p;
    Uname U;

    rho rhoInf;
    rhoInf 1;

    //// Dump to file
    log true;

    CofR (0 0 0);
    liftDir (0 1 0);
    dragDir (1 0 0);
    pitchAxis (0 0 1);
    magUInf 1;
    lRef 1;         // reference lenght for moments!!!
    Aref 1;	// reference area
}

